{
  "author": "Daily Promise",
  "footer": "File 1.json - Kings James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "",

  "fields": [

    {
      "name": "Matthew 25:31-46",
      "value": "31 When the Son of man shall come in his glory, and all the holy angels with him, then shall he sit upon the throne of his glory:\n\n32 And before him shall be gathered all nations: and he shall separate them one from another, as a shepherd divideth his sheep from the goats:\n\n33 And he shall set the sheep on his right hand, but the goats on the left.\n\n34 Then shall the King say unto them on his right hand, Come, ye blessed of my Father, inherit the kingdom prepared for you from the foundation of the world:\n\n35 For I was an hungred, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in:\n\n36 Naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me.\n\n37 Then shall the righteous answer him, saying, Lord, when saw we thee an hungred, and fed thee? or thirsty, and gave thee drink?\n\n38 When saw we thee a stranger, and took thee in? or naked, and clothed thee?\n\n39 Or when saw we thee sick, or in prison, and came unto thee?\n\n40 And the King shall answer and say unto them, Verily I say unto you, Inasmuch as ye have done it unto one of the least of these my brethren, ye have done it unto me.\n\n41 Then shall he say also unto them on the left hand, Depart from me, ye cursed, into everlasting fire, prepared for the devil and his angels:\n\n42 For I was an hungred, and ye gave me no meat: I was thirsty, and ye gave me no drink:\n\n43 I was a stranger, and ye took me not in: naked, and ye clothed me not: sick, and in prison, and ye visited me not.\n\n44 Then shall they also answer him, saying, Lord, when saw we thee an hungred, or athirst, or a stranger, or naked, or sick, or in prison, and did not minister unto thee?\n\n45 Then shall he answer them, saying, Verily I say unto you, Inasmuch as ye did it not to one of the least of these, ye did it not to me.\n\n46 And these shall go away into everlasting punishment: but the righteous into life eternal.",
      "inline": false
    },

    {
      "name": "Mark 10:17-30",
      "value": "17 And when he was gone forth into the way, there came one running, and kneeled to him, and asked him, Good Master, what shall I do that I may inherit eternal life?\n\n18 And Jesus said unto him, Why callest thou me good? there is none good but one, that is, God.\n\n19 Thou knowest the commandments, Do not commit adultery, Do not kill, Do not steal, Do not bear false witness, Defraud not, Honour thy father and mother.\n\n20 And he answered and said unto him, Master, all these have I observed from my youth.\n\n21 Then Jesus beholding him loved him, and said unto him, One thing thou lackest: go thy way, sell whatsoever thou hast, and give to the poor, and thou shalt have treasure in heaven: and come, take up the cross, and follow me.\n\n22 And he was sad at that saying, and went away grieved: for he had great possessions.\n\n23 And Jesus looked round about, and saith unto his disciples, How hardly shall they that have riches enter into the kingdom of God!\n\n24 And the disciples were astonished at his words. But Jesus answereth again, and saith unto them, Children, how hard is it for them that trust in riches to enter into the kingdom of God!\n\n25 It is easier for a camel to go through the eye of a needle, than for a rich man to enter into the kingdom of God.\n\n26 And they were astonished out of measure, saying among themselves, Who then can be saved?\n\n27 And Jesus looking upon them saith, With men it is impossible, but not with God: for with God all things are possible.\n\n28 Then Peter began to say unto him, Lo, we have left all, and have followed thee.\n\n29 And Jesus answered and said, Verily I say unto you, There is no man that hath left house, or brethren, or sisters, or father, or mother, or wife, or children, or lands, for my sake, and the gospel's,\n\n30 But he shall receive an hundredfold now in this time, houses, and brethren, and sisters, and mothers, and children, and lands, with persecutions; and in the world to come eternal life.",
      "inline": false
    },

    {
      "name": "John 3:14-17",
      "value": "14 And as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up:\n\n15 That whosoever believeth in him should not perish, but have eternal life.\n\n16 For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.\n\n17 For God sent not his Son into the world to condemn the world; but that the world through him might be saved.",
      "inline": false
    },

    {
      "name": "John 6:53-54",
      "value": "53 Then Jesus said unto them, Verily, verily, I say unto you, Except ye eat the flesh of the Son of man, and drink his blood, ye have no life in you.\n\n54 Whoso eateth my flesh, and drinketh my blood, hath eternal life; and I will raise him up at the last day.",
      "inline": false
    },

    {
      "name": "John 6:67-69",
      "value": "67 Then said Jesus unto the twelve, Will ye also go away?\n\n68 Then Simon Peter answered him, Lord, to whom shall we go? thou hast the words of eternal life.\n\n69 And we believe and are sure that thou art that Christ, the Son of the living God.",
      "inline": false
    },

    {
      "name": "John 10:27-30",
      "value": "27 My sheep hear my voice, and I know them, and they follow me:\n\n28 And I give unto them eternal life; and they shall never perish, neither shall any man pluck them out of my hand.\n\n29 My Father, which gave them me, is greater than all; and no man is able to pluck them out of my Father's hand.\n\n30 I and my Father are one.",
      "inline": false
    },

    {
      "name": "John 12:25",
      "value": "25 He that loveth his life shall lose it; and he that hateth his life in this world shall keep it unto life eternal.",
      "inline": false
    },

    {
      "name": "John 17:1-3",
      "value": "1 These words spake Jesus, and lifted up his eyes to heaven, and said, Father, the hour is come; glorify thy Son, that thy Son also may glorify thee:\n\n2 As thou hast given him power over all flesh, that he should give eternal life to as many as thou hast given him.\n\n3 And this is life eternal, that they might know thee the only true God, and Jesus Christ, whom thou hast sent.",
      "inline": false
    },

    {
      "name": "Acts 13:47-48",
      "value": "47 For so hath the Lord commanded us, saying, I have set thee to be a light of the Gentiles, that thou shouldest be for salvation unto the ends of the earth.\n\n48 And when the Gentiles heard this, they were glad, and glorified the word of the Lord: and as many as were ordained to eternal life believed.",
      "inline": false
    },

    {
      "name": "Romans 2:5-9",
      "value": "5 But after thy hardness and impenitent heart treasurest up unto thyself wrath against the day of wrath and revelation of the righteous judgment of God;\n\n6 Who will render to every man according to his deeds:\n\n7 To them who by patient continuance in well doing seek for glory and honour and immortality, eternal life:\n\n8 But unto them that are contentious, and do not obey the truth, but obey unrighteousness, indignation and wrath,\n\n9 Tribulation and anguish, upon every soul of man that doeth evil, of the Jew first, and also of the Gentile;",
      "inline": false
    },

    {
      "name": "Romans 6:20-23",
      "value": "20 For when ye were the servants of sin, ye were free from righteousness.\n\n21 What fruit had ye then in those things whereof ye are now ashamed? for the end of those things is death.\n\n22 But now being made free from sin, and become servants to God, ye have your fruit unto holiness, and the end everlasting life.\n\n23 For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.",
      "inline": false
    },

    {
      "name": "1 Timothy 6:12",
      "value": "12 Fight the good fight of faith, lay hold on eternal life, whereunto thou art also called, and hast professed a good profession before many witnesses.",
      "inline": false
    },

    {
      "name": "Titus 1:2",
      "value": "2 In hope of eternal life, which God, that cannot lie, promised before the world began;",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "The promise of eternal life in Heaven with God, if we follow Jesus Christ."
    }
  ]
}