{
    "author": "Daily Promise",
    "footer": "File 5.json - Kings James Version (KJV)",
    "color": "green",
    "url": "",
    "image": "",
  
    "fields": [

      {
        "name": "Psalms 65:13",
        "value": "13 The pastures are clothed with flocks; the valleys also are covered over with corn; they shout for joy, they also sing.",
        "inline": false
      },

      {
        "name": "Psalms 67:4",
        "value": "4 O let the nations be glad and sing for joy: for thou shalt judge the people righteously, and govern the nations upon earth. Selah.",
        "inline": false
      },

      {
        "name": "Psalms 81:1",
        "value": "1 Sing aloud unto God our strength: make a joyful noise unto the God of Jacob.",
        "inline": false
      },

      {
        "name": "Psalms 95:1-2",
        "value": "1 O come, let us sing unto the Lord: let us make a joyful noise to the rock of our salvation.\n\n2 Let us come before his presence with thanksgiving, and make a joyful noise unto him with psalms.",
        "inline": false
      },

      {
        "name": "Psalms 96:12",
        "value": "12 Let the field be joyful, and all that is therein: then shall all the trees of the wood rejoice",
        "inline": false
      },


      {
        "name": "Psalms 126:5",
        "value": "6 They that sow in tears shall reap in joy.",
        "inline": false
      },

      {
        "name": "Isaiah 35:10",
        "value": "10 And the ransomed of the Lord shall return, and come to Zion with songs and everlasting joy upon their heads: they shall obtain joy and gladness, and sorrow and sighing shall flee away.",
        "inline": false
      },

      {
        "name": "Isaiah 51:11",
        "value": "11 Therefore the redeemed of the Lord shall return, and come with singing unto Zion; and everlasting joy shall be upon their head: they shall obtain gladness and joy; and sorrow and mourning shall flee away.",
        "inline": false
      },

      {
        "name": "Isaiah 65:13-14",
        "value": "13 Therefore thus saith the Lord God, Behold, my servants shall eat, but ye shall be hungry: behold, my servants shall drink, but ye shall be thirsty: behold, my servants shall rejoice, but ye shall be ashamed:\n\n14 Behold, my servants shall sing for joy of heart, but ye shall cry for sorrow of heart, and shall howl for vexation of spirit.",
        "inline": false
      },

      {
        "name": "Summary",
        "value": "Joy is a blessing from God. God wants to give us comfort, peace and happiness. The joy of the saints is of God. Singing also brings joy. Thanksgiving also brings joy :)."
      }
    ]
  }