{
  "author": "Daily Promise",
  "footer": "File 7.json - Kings James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "",

  "fields": [

    {
      "name": "Exodus 14:14",
      "value": "14 The LORD shall fight for you, and ye shall hold your peace.",
      "inline": false
    },

    {
      "name": "Leviticus 26:1-13",
      "value": "1 Ye shall make you no idols nor graven image, neither rear you up a standing image, neither shall ye set up any image of stone in your land, to bow down unto it: for I am the Lord your God.\n\n2 Ye shall keep my sabbaths, and reverence my sanctuary: I am the Lord.\n\n3 If ye walk in my statutes, and keep my commandments, and do them;\n\n4 Then I will give you rain in due season, and the land shall yield her increase, and the trees of the field shall yield their fruit.\n\n5 And your threshing shall reach unto the vintage, and the vintage shall reach unto the sowing time: and ye shall eat your bread to the full, and dwell in your land safely.\n\n6 And I will give peace in the land, and ye shall lie down, and none shall make you afraid: and I will rid evil beasts out of the land, neither shall the sword go through your land.\n\n7 And ye shall chase your enemies, and they shall fall before you by the sword.\n\n8 And five of you shall chase an hundred, and an hundred of you shall put ten thousand to flight: and your enemies shall fall before you by the sword.\n\n9 For I will have respect unto you, and make you fruitful, and multiply you, and establish my covenant with you.\n\n10 And ye shall eat old store, and bring forth the old because of the new.\n\n11 And I set my tabernacle among you: and my soul shall not abhor you.\n\n12 And I will walk among you, and will be your God, and ye shall be my people.\n\n13 I am the Lord your God, which brought you forth out of the land of Egypt, that ye should not be their bondmen; and I have broken the bands of your yoke, and made you go upright.",
      "inline": false
    },

    {
      "name": "Numbers 6:26",
      "value": "26 The LORD lift up his countenance upon thee, and give thee peace.",
      "inline": false
    },

    {
      "name": "Psalms 4:8",
      "value": "8 I will both lay me down in peace, and sleep: for thou, LORD, only makest me dwell in safety.",
      "inline": false
    },

    {
      "name": "Psalms 29:11",
      "value": "11 The LORD will give strength unto his people; the LORD will bless his people with peace.",
      "inline": false
    },

    {
      "name": "Psalms 37:11",
      "value": "11 But the meek shall inherit the earth; and shall delight themselves in the abundance of peace.",
      "inline": false
    },

    {
      "name": "Psalms 37:37",
      "value": "11 Mark the perfect man, and behold the upright: for the end of that man is peace.",
      "inline": false
    },

    {
      "name": "Psalms 72:3",
      "value": "3 The mountains shall bring peace to the people, and the little hills, by righteousness.",
      "inline": false
    },

    {
      "name": "Psalms 72:7",
      "value": "11 In his days shall the righteous flourish; and abundance of peace so long as the moon endureth.",
      "inline": false
    },

    {
      "name": "Psalms 85:8",
      "value": "8 I will hear what God the LORD will speak: for he will speak peace unto his people, and to his saints: but let them not turn again to folly.",
      "inline": false
    },

    {
      "name": "Psalms 85:10",
      "value": "10 Mercy and truth are met together; righteousness and peace have kissed each other.",
      "inline": false
    },

    {
      "name": "Psalms 119:165",
      "value": "165 Great peace have they which love thy law: and nothing shall offend them.",
      "inline": false
    },

    {
      "name": "Proverbs 12:20",
      "value": "20 Deceit is in the heart of them that imagine evil: but to the counsellors of peace is joy.",
      "inline": false
    },



    {
      "name": "Study",
      "value": "Covenant of Peace (The Ten Commandments)",
      "inline": false
    },

    {
      "name": "Numbers 25:10-13",
      "value": "10 And the Lord spake unto Moses, saying,\n\n11 Phinehas, the son of Eleazar, the son of Aaron the priest, hath turned my wrath away from the children of Israel, while he was zealous for my sake among them, that I consumed not the children of Israel in my jealousy.\n\n12 Wherefore say, Behold, I give unto him my covenant of peace:\n\n13 And he shall have it, and his seed after him, even the covenant of an everlasting priesthood; because he was zealous for his God, and made an atonement for the children of Israel.",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "God promises us to give us peace and a clear mind, when we surrender and obey Him."
    }
  ]
}