{
  "author": "Daily Promise - Ask in faith and you shall Receive",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1380083496797605928/prayer.webp?ex=6842966a&is=684144ea&hm=3e9a18d2082787f5b88a4173bf2303cdc6e66840a79a8dd4acea356a22b08c41&",

  "fields": [

    {
      "name": "Isaiah 1:10-17",
      "value": "10 Hear the word of the Lord, ye rulers of Sodom; give ear unto the law of our God, ye people of Gomorrah.\n\n11 To what purpose is the multitude of your sacrifices unto me? saith the Lord: I am full of the burnt offerings of rams, and the fat of fed beasts; and I delight not in the blood of bullocks, or of lambs, or of he goats.\n\n12 When ye come to appear before me, who hath required this at your hand, to tread my courts?\n\n13 Bring no more vain oblations; incense is an abomination unto me; the new moons and sabbaths, the calling of assemblies, I cannot away with; it is iniquity, even the solemn meeting.\n\n14 Your new moons and your appointed feasts my soul hateth: they are a trouble unto me; I am weary to bear them.\n\n15 And when ye spread forth your hands, I will hide mine eyes from you: yea, when ye make many prayers, I will not hear: your hands are full of blood.\n\n16 Wash you, make you clean; put away the evil of your doings from before mine eyes; cease to do evil;\n\n17 Learn to do well; seek judgment, relieve the oppressed, judge the fatherless, plead for the widow.",
      "inline": false
    },

    {
      "name": "Matthew 7:7-11",
      "value": "7 Ask, and it shall be given you; seek, and ye shall find; knock, and it shall be opened unto you:\n\n8 For every one that asketh receiveth; and he that seeketh findeth; and to him that knocketh it shall be opened.\n\n9 Or what man is there of you, whom if his son ask bread, will he give him a stone?\n\n10 Or if he ask a fish, will he give him a serpent?\n\n11 If ye then, being evil, know how to give good gifts unto your children, how much more shall your Father which is in heaven give good things to them that ask him?",
      "inline": false
    },

    {
      "name": "Mark 9:23",
      "value": "23 Jesus said unto him, If thou canst believe, all things are possible to him that believeth.",
      "inline": false
    },

    {
      "name": "1 Peter 3:12",
      "value": "12 For the eyes of the Lord are over the righteous, and his ears are open unto their prayers: but the face of the Lord is against them that do evil.",
      "inline": false
    },

    {
      "name": "Notes",
      "value": "God can help you have more faith and belief.",
      "inline": false
    },

    {
      "name": "Mark 9:24",
      "value": "24 And straightway the father of the child cried out, and said with tears, Lord, I believe; help thou mine unbelief.",
      "inline": false
    },

    {
      "name": "End of Notes",
      "value": ".",
      "inline": false
    },

    {
      "name": "Mark 11:22-24",
      "value": "22 And Jesus answering saith unto them, Have faith in God.\n\n23 For verily I say unto you, That whosoever shall say unto this mountain, Be thou removed, and be thou cast into the sea; and shall not doubt in his heart, but shall believe that those things which he saith shall come to pass; he shall have whatsoever he saith.\n\n24 Therefore I say unto you, What things soever ye desire, when ye pray, believe that ye receive them, and ye shall have them.",
      "inline": false
    },

    {
      "name": "Luke 11:9-13",
      "value": "9 And I say unto you, Ask, and it shall be given you; seek, and ye shall find; knock, and it shall be opened unto you.\n\n10 For every one that asketh receiveth; and he that seeketh findeth; and to him that knocketh it shall be opened.\n\n11 If a son shall ask bread of any of you that is a father, will he give him a stone? or if he ask a fish, will he for a fish give him a serpent?\n\n12 Or if he shall ask an egg, will he offer him a scorpion?\n\n13 If ye then, being evil, know how to give good gifts unto your children: how much more shall your heavenly Father give the Holy Spirit to them that ask him?",
      "inline": false
    },

    {
      "name": "James 4:2-3",
      "value": "2 Ye lust, and have not: ye kill, and desire to have, and cannot obtain: ye fight and war, yet ye have not, because ye ask not.\n\n3 Ye ask, and receive not, because ye ask amiss, that ye may consume it upon your lusts.",
      "inline": false
    },

    {
      "name": "Notes",
      "value": "Fear not, and believe only.",
      "inline": false
    },

    {
      "name": "Mark 5:36",
      "value": "36 As soon as Jesus heard the word that was spoken, he saith unto the ruler of the synagogue, Be not afraid, only believe.",
      "inline": false
    },

    {
      "name": "Luke 8:50",
      "value": "50 But when Jesus heard it, he answered him, saying, Fear not: believe only, and she shall be made whole.",
      "inline": false
    },

    {
      "name": "Study",
      "value": "How to pray?",
      "inline": false
    },

    {
      "name": "Looking up",
      "value": ".",
      "inline": false
    },

    {
      "name": "Psalm 40:12",
      "value": "12 For innumerable evils have compassed me about: mine iniquities have taken hold upon me, so that I am not able to look up; they are more than the hairs of mine head: therefore my heart faileth me.",
      "inline": false
    },

    {
      "name": "Psalm 123:1-3",
      "value": "1 Unto thee lift I up mine eyes, O thou that dwellest in the heavens.\n\n2 Behold, as the eyes of servants look unto the hand of their masters, and as the eyes of a maiden unto the hand of her mistress; so our eyes wait upon the Lord our God, until that he have mercy upon us.\n\n3 Have mercy upon us, O Lord, have mercy upon us: for we are exceedingly filled with contempt.",
      "inline": false
    },

    {
      "name": "Isaiah 38:14",
      "value": "14 Like a crane or a swallow, so did I chatter: I did mourn as a dove: mine eyes fail with looking upward: O Lord, I am oppressed; undertake for me.",
      "inline": false
    },

    {
      "name": "Daniel 4:34",
      "value": "34 And at the end of the days I Nebuchadnezzar lifted up mine eyes unto heaven, and mine understanding returned unto me, and I blessed the most High, and I praised and honoured him that liveth for ever, whose dominion is an everlasting dominion, and his kingdom is from generation to generation:",
      "inline": false
    },

    {
      "name": "Matthew 14:19",
      "value": "19 And looking up to heaven, he sighed, and saith unto him, Ephphatha, that is, Be opened.",
      "inline": false
    },

    {
      "name": "Mark 7:34",
      "value": "34 And looking up to heaven, he sighed, and saith unto him, Ephphatha, that is, Be opened.",
      "inline": false
    },

    {
      "name": "Mark 8:25",
      "value": "25 After that he put his hands again upon his eyes, and made him look up: and he was restored, and saw every man clearly.",
      "inline": false
    },

    {
      "name": "Spread arms in worship",
      "value": ".",
      "inline": false
    },

    {
      "name": "Psalm 63:4",
      "value": "4 Thus will I bless thee while I live: I will lift up my hands in thy name.",
      "inline": false
    },

    {
      "name": "Kneeling down in worship",
      "value": ".",
      "inline": false
    },

    {
      "name": "2 Chronicles 6:13",
      "value": "13 For Solomon had made a brasen scaffold of five cubits long, and five cubits broad, and three cubits high, and had set it in the midst of the court: and upon it he stood, and kneeled down upon his knees before all the congregation of Israel, and spread forth his hands toward heaven.",
      "inline": false
    },

    {
      "name": "Daniel 6:10",
      "value": "10 Now when Daniel knew that the writing was signed, he went into his house; and his windows being open in his chamber toward Jerusalem, he kneeled upon his knees three times a day, and prayed, and gave thanks before his God, as he did aforetime.",
      "inline": false
    },

    {
      "name": "Mark 10:17",
      "value": "17 And when he was gone forth into the way, there came one running, and kneeled to him, and asked him, Good Master, what shall I do that I may inherit eternal life?",
      "inline": false
    },

    {
      "name": "Luke 22:41",
      "value": "41 And he was withdrawn from them about a stone's cast, and kneeled down, and prayed,",
      "inline": false
    },

    {
      "name": "Acts 7:59-60",
      "value": "59 And they stoned Stephen, calling upon God, and saying, Lord Jesus, receive my spirit.\n\n60 And he kneeled down, and cried with a loud voice, Lord, lay not this sin to their charge. And when he had said this, he fell asleep.",
      "inline": false
    },

    {
      "name": "Acts 9:40",
      "value": "40 But Peter put them all forth, and kneeled down, and prayed; and turning him to the body said, Tabitha, arise. And she opened her eyes: and when she saw Peter, she sat up.",
      "inline": false
    },

    {
      "name": "Acts 20:36 (Paul also prayed kneeled)",
      "value": "36 And when he had thus spoken, he kneeled down, and prayed with them all.",
      "inline": false
    },

    {
      "name": "Steps in prayer",
      "value": ".",
      "inline": false
    },

    {
      "name": "Matthew 6:5-13",
      "value": "5 And when thou prayest, thou shalt not be as the hypocrites are: for they love to pray standing in the synagogues and in the corners of the streets, that they may be seen of men. Verily I say unto you, They have their reward.\n\n6 But thou, when thou prayest, enter into thy closet, and when thou hast shut thy door, pray to thy Father which is in secret; and thy Father which seeth in secret shall reward thee openly.\n\n7 But when ye pray, use not vain repetitions, as the heathen do: for they think that they shall be heard for their much speaking.\n\n8 Be not ye therefore like unto them: for your Father knoweth what things ye have need of, before ye ask him.\n\n9 After this manner therefore pray ye: Our Father which art in heaven, Hallowed be thy name.\n\n10 Thy kingdom come, Thy will be done in earth, as it is in heaven.\n\n11 Give us this day our daily bread.\n\n12 And forgive us our debts, as we forgive our debtors.\n\n13 And lead us not into temptation, but deliver us from evil: For thine is the kingdom, and the power, and the glory, for ever. Amen.",
      "inline": false
    },

    {
      "name": "Notes: Matthew 6:9",
      "value": "Acknowledge God as God of heaven and of earth. Acknowledge Him as your loving Father who cares for you.",
      "inline": false
    },

    {
      "name": "Notes: Matthew 6:10",
      "value": "May the will of God be done in your life. Accept His will and do His will. Surrender to the will of the LORD.",
      "inline": false
    },

    {
      "name": "Notes: Matthew 6:11",
      "value": "Ask God whatever you want. Present your request to God and listen for His answer.",
      "inline": false
    },

    {
      "name": "Notes: Matthew 6:12",
      "value": "Confess your sins to God and ask for His forgiveness. Be true and honest with God. For we were sinners, saved by the grace of God through Jesus Christ. Then believe that you are forgiven of your sins.",
      "inline": false
    },

    {
      "name": "Notes: Matthew 6:13",
      "value": "Be humble and ask for help. For we need God in our lives daily. Acknowledge that God can do all things and has the power to help you.",
      "inline": false
    },

    {
      "name": "Testimonies to the Church Volume 31  108.4-109.3",
      "value": "https://m.egwwritings.org/en/book/12858.511#544",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "God promises to answer our prayers and give us whatever we ask for, as long as it is in faith, it is good, and we don't have blood/sin upon our head."
    }
  ]
}