{
    "author": "Daily Promise - Deliverance",
    "footer": "King James Version (KJV)",
    "color": "green",
    "url": "",
    "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1377668957045260348/1c7ff6fbb67a9fe58e3b354404f24d94.png?ex=6839cdb3&is=68387c33&hm=812760e6d37b6ac67e9106fc3a6ab6b94c47ebc30ab3c2fcba629fd505366a6c&",
  
    "fields": [

      {
        "name": "Genesis 32:11",
        "value": "11 Deliver me, I pray thee, from the hand of my brother, from the hand of Esau: for I fear him, lest he will come and smite me, and the mother with the children.",
        "inline": false
      },

      {
        "name": "Genesis 45:4-7",
        "value": "4 And Joseph said unto his brethren, Come near to me, I pray you. And they came near. And he said, I am Joseph your brother, whom ye sold into Egypt.\n\n5 Now therefore be not grieved, nor angry with yourselves, that ye sold me hither: for God did send me before you to preserve life.\n\n6 For these two years hath the famine been in the land: and yet there are five years, in the which there shall neither be earing nor harvest.\n\n7 And God sent me before you to preserve you a posterity in the earth, and to save your lives by a great deliverance.",
        "inline": false
      },

      {
        "name": "Deuteronomy 23:14",
        "value": "14 For the Lord thy God walketh in the midst of thy camp, to deliver thee, and to give up thine enemies before thee; therefore shall thy camp be holy: that he see no unclean thing in thee, and turn away from thee.",
        "inline": false
      },

      {
        "name": "Deuteronomy 32:39",
        "value": "39 See now that I, even I, am he, and there is no god with me: I kill, and I make alive; I wound, and I heal: neither is there any that can deliver out of my hand.",
        "inline": false
      },

      {
        "name": "Joshua 2:24",
        "value": "24 And they said unto Joshua, Truly the Lord hath delivered into our hands all the land; for even all the inhabitants of the country do faint because of us.",
        "inline": false
      },

      {
        "name": "Judges 6:9",
        "value": "9 And I delivered you out of the hand of the Egyptians, and out of the hand of all that oppressed you, and drave them out from before you, and gave you their land;",
        "inline": false
      },

      {
        "name": "2 Samuel 22:20-22",
        "value": "20 He brought me forth also into a large place: He delivered me, because he delighted in me.\n\n21 The LORD rewarded me according to my righteousness: According to the cleanness of my hands hath he recompensed me.\n\n22 For I have kept the ways of the LORD, And have not wickedly departed from my God.",
        "inline": false
      },

      {
        "name": "2 Kings 17:39",
        "value": "39 But the Lord your God ye shall fear; and he shall deliver you out of the hand of all your enemies.",
        "inline": false
      },

      {
        "name": "Matthew 6:13",
        "value": "13 And lead us not into temptation, but deliver us from evil: For thine is the kingdom, and the power, and the glory, for ever. Amen.",
        "inline": false
      },

      {
        "name": "Luke 4:18",
        "value": "18 The Spirit of the Lord is upon me, because he hath anointed me to preach the gospel to the poor; he hath sent me to heal the brokenhearted, to preach deliverance to the captives, and recovering of sight to the blind, to set at liberty them that are bruised,",
        "inline": false
      },

      {
        "name": "Luke 11:4",
        "value": "4 And forgive us our sins; for we also forgive every one that is indebted to us. And lead us not into temptation; but deliver us from evil.",
        "inline": false
      },

      {
        "name": "Acts 26:16-18",
        "value": "16 But rise, and stand upon thy feet: for I have appeared unto thee for this purpose, to make thee a minister and a witness both of these things which thou hast seen, and of those things in the which I will appear unto thee;\n\n17 Delivering thee from the people, and from the Gentiles, unto whom now I send thee,\n\n18 To open their eyes, and to turn them from darkness to light, and from the power of Satan unto God, that they may receive forgiveness of sins, and inheritance among them which are sanctified by faith that is in me.",
        "inline": false
      },

      {
        "name": "1 Thessalonians 1:10",
        "value": "10 And to wait for his Son from heaven, whom he raised from the dead, even Jesus, which delivered us from the wrath to come.",
        "inline": false
      },

      {
        "name": "Summary",
        "value": "God promises us to deliver us from our troubles and our enemies, for He loves us and we are His."
      }
    ]
  }