{
    "author": "Daily Promise - Forgiveness",
    "footer": "King James Version (KJV)",
    "color": "green",
    "url": "",
    "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1377667933072785428/Forgiving-People.png?ex=6839ccbf&is=68387b3f&hm=b3b8fd64e2b5ad7f5d731385ba03438f06c8536d22d949a3e8dbf31951511b3a&",
  
    "fields": [
      {
        "name": "Daniel 9:9",
        "value": "9 To the Lord our God belong mercies and forgivenesses, though we have rebelled against him;",
        "inline": false
      },

      {
        "name": "Matthew 6:14-15",
        "value": "14 For if ye forgive men their trespasses, your heavenly Father will also forgive you:\n\n15 But if ye forgive not men their trespasses, neither will your Father forgive your trespasses.",
        "inline": false
      },

      {
        "name": "Mark 11:25-26",
        "value": "25 And when ye stand praying, forgive, if ye have ought against any: that your Father also which is in heaven may forgive you your trespasses.\n\n26 But if ye do not forgive, neither will your Father which is in heaven forgive your trespasses.",
        "inline": false
      },

      {
        "name": "Acts 5:31",
        "value": "31 Him hath God exalted with his right hand to be a Prince and a Saviour, for to give repentance to Israel, and forgiveness of sins.",
        "inline": false
      },

      {
        "name": "Ephesians 1:7",
        "value": "7 In whom we have redemption through his blood, the forgiveness of sins, according to the riches of his grace;",
        "inline": false
      },

      {
        "name": "Colossians 1:14",
        "value": "14 In whom we have redemption through his blood, even the forgiveness of sins:",
        "inline": false
      },

      {
        "name": "1 John 1:9",
        "value": "9 If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.",
        "inline": false
      },

      {
        "name": "Study - Steps to Christ 54.2",
        "value": "With the rich promises of the Bible before you, can you give place to doubt? Can you believe that when the poor sinner longs to return, longs to forsake his sins, the Lord sternly withholds him from coming to His feet in repentance? Away with such thoughts! Nothing can hurt your own soul more than to entertain such a conception of our heavenly Father. He hates sin, but He loves the sinner, and He gave Himself in the person of Christ, that all who would might be saved and have eternal blessedness in the kingdom of glory. What stronger or more tender language could have been employed than He has chosen in which to express His love toward us? He declares, “Can a woman forget her sucking child, that she should not have compassion on the son of her womb? yea, they may forget, yet will I not forget thee.” Isaiah 49:15. (https://m.egwwritings.org/en/book/108.186#210)",
        "inline": false
      },
  
      {
        "name": "Summary",
        "value": "God offers forgiveness of sins if we repent of them and have forgiven men their trespasses against us."
      }
    ]
  }