{
  "author": "Daily Promise - Grace to the Humble",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1378800462895251622/man-praying.png?ex=683deb7f&is=683c99ff&hm=ba48e54fa77b8c09e085c0b5a32b75676e1dbaeec7518addf6839a537146f345&",

  "fields": [

    {
      "name": "Study: Honor",
      "value": "God honors the humble, for they submit themselves to God. Honor God and God will honor you.",
      "inline": false
    },

    {
      "name": "Psalm 49:20",
      "value": "20 Man that is in honour, and understandeth not, is like the beasts that perish.",
      "inline": false
    },

    {
      "name": "Psalm 66:2",
      "value": "2 Sing forth the honour of his name: make his praise glorious.",
      "inline": false
    },

    {
      "name": "Psalm 71:8",
      "value": "8 Let my mouth be filled with thy praise and with thy honour all the day.",
      "inline": false
    },

    {
      "name": "Psalm 91:14-16",
      "value": "14 Because he hath set his love upon me, therefore will I deliver him: I will set him on high, because he hath known my name.\n\n15 He shall call upon me, and I will answer him: I will be with him in trouble; I will deliver him, and honour him.\n\n16 With long life will I satisfy him, and shew him my salvation.",
      "inline": false
    },

    {
      "name": "Proverbs 8:18",
      "value": "18 Riches and honour are with me; yea, durable riches and righteousness.",
      "inline": false
    },

    {
      "name": "Proverbs 15:33",
      "value": "33 The fear of the LORD is the instruction of wisdom; and before honour is humility.",
      "inline": false
    },

    {
      "name": "Proverbs 18:12",
      "value": "12 Before destruction the heart of man is haughty, and before honour is humility.",
      "inline": false
    },

    {
      "name": "Proverbs 29:23",
      "value": "23 A man's pride shall bring him low: but honour shall uphold the humble in spirit.",
      "inline": false
    },

    {
      "name": "Malachi 1:6",
      "value": "6 A son honoureth his father, and a servant his master: if then I be a father, where is mine honour? and if I be a master, where is my fear? saith the LORD of hosts unto you, O priests, that despise my name. And ye say, Wherein have we despised thy name?",
      "inline": false
    },

    {
      "name": "John 8:54",
      "value": "54 Jesus answered, If I honour myself, my honour is nothing: it is my Father that honoureth me; of whom ye say, that he is your God:",
      "inline": false
    },

    {
      "name": "End of Study",
      "value": ".",
      "inline": false
    },

    {
      "name": "Psalm 37:34",
      "value": "34 Wait on the Lord, and keep his way, and he shall exalt thee to inherit the land: when the wicked are cut off, thou shalt see it.",
      "inline": false
    },

    {
      "name": "Notes: Psalm 37:34",
      "value": "Waiting on the LORD shows your faith and patience.",
      "inline": false
    },

    {
      "name": "End of Notes",
      "value": ".",
      "inline": false
    },

    {
      "name": "Matthew 23:12",
      "value": "12 And whosoever shall exalt himself shall be abased; and he that shall humble himself shall be exalted.",
      "inline": false
    },

    {
      "name": "James 4:6,10",
      "value": "6 But he giveth more grace. Wherefore he saith, God resisteth the proud, but giveth grace unto the humble.\n\n10 Humble yourselves in the sight of the Lord, and he shall lift you up.",
      "inline": false
    },

    {
      "name": "1 Peter 5:5-6",
      "value": "5 Likewise, ye younger, submit yourselves unto the elder. Yea, all of you be subject one to another, and be clothed with humility: for God resisteth the proud, and giveth grace to the humble.\n\n6 Humble yourselves therefore under the mighty hand of God, that he may exalt you in due time:",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "The humble in God are blessed and God will exalt them in due time. Therefore, submit yourself to God."
    }
  ]
}