{
    "author": "Daily Promise - Joy",
    "footer": "King James Version (KJV)",
    "color": "green",
    "url": "",
    "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1377668598239072377/rejoicing.png?ex=6839cd5d&is=68387bdd&hm=dc77a288896a80953b1acb765619571d3e09cf425fb04f51f032cb9ad74e8cbb&",
  
    "fields": [

      {
        "name": "Psalm 30:5",
        "value": "5 For his anger endureth but a moment; in his favour is life: weeping may endure for a night, but joy cometh in the morning.",
        "inline": false
      },

      {
        "name": "Psalm 51:12",
        "value": "12 Restore unto me the joy of thy salvation; and uphold me with thy free spirit.",
        "inline": false
      },

      {
        "name": "Psalm 65:13",
        "value": "13 The pastures are clothed with flocks; the valleys also are covered over with corn; they shout for joy, they also sing.",
        "inline": false
      },

      {
        "name": "Psalm 67:4",
        "value": "4 O let the nations be glad and sing for joy: for thou shalt judge the people righteously, and govern the nations upon earth. Selah.",
        "inline": false
      },

      {
        "name": "Psalm 81:1",
        "value": "1 Sing aloud unto God our strength: make a joyful noise unto the God of Jacob.",
        "inline": false
      },

      {
        "name": "Psalm 89:15",
        "value": "15 Blessed is the people that know the joyful sound: they shall walk, O Lord, in the light of thy countenance.",
        "inline": false
      },

      {
        "name": "Psalm 95:1-2",
        "value": "1 O come, let us sing unto the Lord: let us make a joyful noise to the rock of our salvation.\n\n2 Let us come before his presence with thanksgiving, and make a joyful noise unto him with psalms.",
        "inline": false
      },

      {
        "name": "Psalm 96:12",
        "value": "12 Let the field be joyful, and all that is therein: then shall all the trees of the wood rejoice",
        "inline": false
      },

      {
        "name": "Psalm 126:5",
        "value": "6 They that sow in tears shall reap in joy.",
        "inline": false
      },

      {
        "name": "Proverbs 12:20",
        "value": "20 Deceit is in the heart of them that imagine evil: but to the counsellors of peace is joy.",
        "inline": false
      },

      {
        "name": "Isaiah 29:19",
        "value": "19 The meek also shall increase their joy in the Lord, and the poor among men shall rejoice in the Holy One of Israel.",
        "inline": false
      },

      {
        "name": "Isaiah 35:10",
        "value": "10 And the ransomed of the Lord shall return, and come to Zion with songs and everlasting joy upon their heads: they shall obtain joy and gladness, and sorrow and sighing shall flee away.",
        "inline": false
      },

      {
        "name": "Isaiah 51:11",
        "value": "11 Therefore the redeemed of the Lord shall return, and come with singing unto Zion; and everlasting joy shall be upon their head: they shall obtain gladness and joy; and sorrow and mourning shall flee away.",
        "inline": false
      },

      {
        "name": "Isaiah 65:13-14",
        "value": "13 Therefore thus saith the Lord God, Behold, my servants shall eat, but ye shall be hungry: behold, my servants shall drink, but ye shall be thirsty: behold, my servants shall rejoice, but ye shall be ashamed:\n\n14 Behold, my servants shall sing for joy of heart, but ye shall cry for sorrow of heart, and shall howl for vexation of spirit.",
        "inline": false
      },

      {
        "name": "Galatians 5:22-23",
        "value": "22 But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, faith,\n\n23 Meekness, temperance: against such there is no law.",
        "inline": false
      },

      {
        "name": "Philippians 1:4",
        "value": "4 Always in every prayer of mine for you all making request with joy,",
        "inline": false
      },

      {
        "name": "Philippians 2:2",
        "value": "2 Fulfil ye my joy, that ye be likeminded, having the same love, being of one accord, of one mind.",
        "inline": false
      },

      {
        "name": "3 John 1:4",
        "value": "4 I have no greater joy than to hear that my children walk in truth.",
        "inline": false
      },

      {
        "name": "Study - Redemption; or the Temptation of Christ in The Wilderness",
        "value": "The Lord knew that Adam could not be happy without labor; therefore, he gave him the pleasant employment of dressing the garden. And, as he tended the things of beauty and usefulness around him, he could behold the goodness and glory of God in his created works. Adam had themes for contemplation in the works of God in Eden, which was Heaven in miniature. God did not form man merely to contemplate his glorious works; therefore, he gave him hands for labor, as well as a mind and heart for contemplation. If the happiness of man consisted in doing nothing, the Creator would not have given Adam his appointed work. Man was to find happiness in labor as well as in meditation. Adam could take in the grand idea that he was created in the image of God, to be like him in righteousness and holiness. His mind was capable of continual cultivation, expansion, refinement, and noble elevation; for God was his teacher, and angels were his companions. { 2Red 7.3 } (https://m.egwwritings.org/en/book/334.20#20)",
        "inline": false
      },

      {
        "name": "Summary",
        "value": "Joy is a blessing and a promise of God. God wants to give us comfort, peace and happiness. The joy of the saints is of God. Singing and Thanksgiving brings joy :)."
      }
    ]
  }