{
  "author": "Daily Promise - Knowledge and Wisdom",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1378593809130324078/Wisdom20tiles20and20blue20plant.png?ex=683d2b09&is=683bd989&hm=7158752fbc70c3d3ec3c32dbeac96a7635dd1d008b6a8348ead06bf032117b5a&",

  "fields": [

    {
      "name": "Numbers 14:21",
      "value": "21 But as truly as I live, all the earth shall be filled with the glory of the Lord.",
      "inline": false
    },

    {
      "name": "Habakkuk 2:14",
      "value": "14 For the earth shall be filled with the knowledge of the glory of the LORD, as the waters cover the sea.",
      "inline": false
    },

    {
      "name": "Psalm 112:1",
      "value": "1 Praise ye the LORD. Blessed is the man that feareth the LORD, that delighteth greatly in his commandments.",
      "inline": false
    },

    {
      "name": "Proverbs 9:10",
      "value": "10 The fear of the Lord is the beginning of wisdom: and the knowledge of the holy is understanding.",
      "inline": false
    },

    {
      "name": "James 1:5-8",
      "value": "5 If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.\n\n6 But let him ask in faith, nothing wavering. For he that wavereth is like a wave of the sea driven with the wind and tossed.\n\n7 For let not that man think that he shall receive any thing of the Lord.\n\n8 A double minded man is unstable in all his ways.",
      "inline": false
    },

    {
      "name": "Note",
      "value": "God promises that He will give us and fill us with wisdom and knowledge, only if we study to get that knowledge.",
      "inline": false
    },

    {
      "name": "2 Timothy 2:15",
      "value": "15 Study to shew thyself approved unto God, a workman that needeth not to be ashamed, rightly dividing the word of truth.",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "God is willing to give us understanding and knowledge of the scriptures and truths, but we have got to work for it."
    }
  ]
}