{
  "author": "Daily Promise - Light and Guidance",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1377991017315438644/godlight_clours__1008x675.png?ex=683af9a4&is=6839a824&hm=30b539f5276c448f367967d086e8f6460fae218de165b9a1d4e668217854b7a5&",

  "fields": [

    {
      "name": "Genesis 1:3",
      "value": "3 And God said, Let there be light: and there was light.",
      "inline": false
    },

    {
      "name": "Notes",
      "value": "God reveals secrets to His children.",
      "inline": false
    },

    {
      "name": "Psalms 90:8",
      "value": "8 Thou hast set our iniquities before thee, our secret sins in the light of thy countenance.",
      "inline": false
    },

    {
      "name": "Daniel 2:20-23",
      "value": "20 Daniel answered and said, Blessed be the name of God for ever and ever: for wisdom and might are his:\n\n21 And he changeth the times and the seasons: he removeth kings, and setteth up kings: he giveth wisdom unto the wise, and knowledge to them that know understanding:\n\n22 He revealeth the deep and secret things: he knoweth what is in the darkness, and the light dwelleth with him.\n\n23 I thank thee, and praise thee, O thou God of my fathers, who hast given me wisdom and might, and hast made known unto me now what we desired of thee: for thou hast now made known unto us the king's matter.",
      "inline": false
    },

    {
      "name": "1 Corinthians 4:4-5",
      "value": "4 For I know nothing by myself; yet am I not hereby justified: but he that judgeth me is the Lord.\n\n5 Therefore judge nothing before the time, until the Lord come, who both will bring to light the hidden things of darkness, and will make manifest the counsels of the hearts: and then shall every man have praise of God.",
      "inline": false
    },

    {
      "name": "Hebrews 4:12-14",
      "value": "12 For the word of God is quick, and powerful, and sharper than any twoedged sword, piercing even to the dividing asunder of soul and spirit, and of the joints and marrow, and is a discerner of the thoughts and intents of the heart.\n\n13 Neither is there any creature that is not manifest in his sight: but all things are naked and opened unto the eyes of him with whom we have to do.\n\n14 Seeing then that we have a great high priest, that is passed into the heavens, Jesus the Son of God, let us hold fast our profession.",
      "inline": false
    },

    {
      "name": "Notes",
      "value": "God will guide you in His light.",
      "inline": false
    },

    {
      "name": "Exodus 13:21-22",
      "value": "21 And the Lord went before them by day in a pillar of a cloud, to lead them the way; and by night in a pillar of fire, to give them light; to go by day and night:\n\n22 He took not away the pillar of the cloud by day, nor the pillar of fire by night, from before the people.",
      "inline": false
    },

    {
      "name": "2 Samuel 22:29",
      "value": "29 For thou art my lamp, O LORD: And the LORD will lighten my darkness.",
      "inline": false
    },

    {
      "name": "Nehemiah 9:12-15,19",
      "value": "12 Moreover thou leddest them in the day by a cloudy pillar; and in the night by a pillar of fire, to give them light in the way wherein they should go.\n\n13 Thou camest down also upon mount Sinai, and spakest with them from heaven, and gavest them right judgments, and true laws, good statutes and commandments:\n\n14 And madest known unto them thy holy sabbath, and commandedst them precepts, statutes, and laws, by the hand of Moses thy servant:\n\n15 And gavest them bread from heaven for their hunger, and broughtest forth water for them out of the rock for their thirst, and promisedst them that they should go in to possess the land which thou hadst sworn to give them.\n\n19 Yet thou in thy manifold mercies forsookest them not in the wilderness: the pillar of the cloud departed not from them by day, to lead them in the way; neither the pillar of fire by night, to shew them light, and the way wherein they should go.",
      "inline": false
    },

    {
      "name": "Job 38:19-20,24",
      "value": "19 Where is the way where light dwelleth? and as for darkness, where is the place thereof,\n\n20 That thou shouldest take it to the bound thereof, and that thou shouldest know the paths to the house thereof?\n\n24 By what way is the light parted, which scattereth the east wind upon the earth?",
      "inline": false
    },

    {
      "name": "Psalms 119:105-110",
      "value": "105 Thy word is a lamp unto my feet, and a light unto my path.\n\n106 I have sworn, and I will perform it, that I will keep thy righteous judgments.\n\n107 I am afflicted very much: quicken me, O Lord, according unto thy word.\n\n108 Accept, I beseech thee, the freewill offerings of my mouth, O Lord, and teach me thy judgments.\n\n109 My soul is continually in my hand: yet do I not forget thy law.\n\n110 The wicked have laid a snare for me: yet I erred not from thy precepts.",
      "inline": false
    },

    {
      "name": "Proverbs 3:5-7",
      "value": "5 Trust in the Lord with all thine heart; and lean not unto thine own understanding.\n\n6 In all thy ways acknowledge him, and he shall direct thy paths.\n\n7 Be not wise in thine own eyes: fear the Lord, and depart from evil.",
      "inline": false
    },

    {
      "name": "Proverbs 4:18-27",
      "value": "18 But the path of the just is as the shining light, that shineth more and more unto the perfect day.\n\n19 The way of the wicked is as darkness: they know not at what they stumble.\n\n20 My son, attend to my words; incline thine ear unto my sayings.\n\n21 Let them not depart from thine eyes; keep them in the midst of thine heart.\n\n22 For they are life unto those that find them, and health to all their flesh.\n\n23 Keep thy heart with all diligence; for out of it are the issues of life.\n\n24 Put away from thee a froward mouth, and perverse lips put far from thee.\n\n25 Let thine eyes look right on, and let thine eyelids look straight before thee.\n\n26 Ponder the path of thy feet, and let all thy ways be established.\n\n27 Turn not to the right hand nor to the left: remove thy foot from evil.",
      "inline": false
    },

    {
      "name": "Proverbs 6:23",
      "value": "23 For the commandment is a lamp; and the law is light; and reproofs of instruction are the way of life:",
      "inline": false
    },

    {
      "name": "Mark 13:11",
      "value": "11 But when they shall lead you, and deliver you up, take no thought beforehand what ye shall speak, neither do ye premeditate: but whatsoever shall be given you in that hour, that speak ye: for it is not ye that speak, but the Holy Ghost.",
      "inline": false
    },

    {
      "name": "End of Notes",
      "value": ".",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "God promises to guide us in His Light. The Light which God gives us is His word and His law, which shall light our way to go."
    }
  ]
}