{
  "author": "Daily Promise - Abundance of Mercies from God",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "Image of pity",

  "fields": [

    {
      "name": "Deuteronomy 7:9",
      "value": "9 Know therefore that the LORD thy God, he is God, the faithful God, which keepeth covenant and mercy with them that love him and keep his commandments to a thousand generations;",
      "inline": false
    },

    {
      "name": "Deuteronomy 7:12-13",
      "value": "12 Wherefore it shall come to pass, if ye hearken to these judgments, and keep, and do them, that the LORD thy God shall keep unto thee the covenant and the mercy which he sware unto thy fathers:\n\n13 And he will love thee, and bless thee, and multiply thee: he will also bless the fruit of thy womb, and the fruit of thy land, thy corn, and thy wine, and thine oil, the increase of thy kine, and the flocks of thy sheep, in the land which he sware unto thy fathers to give thee.",
      "inline": false
    },

    {
      "name": "1 Kings 8:23-24",
      "value": "23 And he said, Lord God of Israel, there is no God like thee, in heaven above, or on earth beneath, who keepest covenant and mercy with thy servants that walk before thee with all their heart:\n\n24 Who hast kept with thy servant David my father that thou promisedst him: thou spakest also with thy mouth, and hast fulfilled it with thine hand, as it is this day.",
      "inline": false
    },

    {
      "name": "2 Chronicles 6:14-15",
      "value": "14 And said, O Lord God of Israel, there is no God like thee in the heaven, nor in the earth; which keepest covenant, and shewest mercy unto thy servants, that walk before thee with all their hearts:\n\n15 Thou which hast kept with thy servant David my father that which thou hast promised him; and spakest with thy mouth, and hast fulfilled it with thine hand, as it is this day.",
      "inline": false
    },

    {
      "name": "Psalms 100:5",
      "value": "5 For the LORD is good; his mercy is everlasting; And his truth endureth to all generations.",
      "inline": false
    },

    {
      "name": "Notes",
      "value": "God has mercy on them that keep His commandments. See the Ten Commandments.",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "God promises to have an abundance of mercy upon His children."
    }
  ]
}