{
  "author": "Daily Promise - Not Forsaking His People",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1378050896805499000/sleeping-and-tired-child-with-caring-father-holding-his-sleepy-son-on-a-home-lounge-sofa.png?ex=683b3168&is=6839dfe8&hm=725d99c5f57acb69846bcfa1c8707683599ce85219fd12a6cd0412d4aa187682&",

  "fields": [

    {
      "name": "Deuteronomy 31:8",
      "value": "8 And the Lord, he it is that doth go before thee; he will be with thee, he will not fail thee, neither forsake thee: fear not, neither be dismayed.",
      "inline": false
    },

    {
      "name": "1 Samuel 12:22",
      "value": "22 For the LORD will not forsake his people for his great name's sake: because it hath pleased the LORD to make you his people.",
      "inline": false
    },

    {
      "name": "Ezra 9:9",
      "value": "9 For we were bondmen; yet our God hath not forsaken us in our bondage, but hath extended mercy unto us in the sight of the kings of Persia, to give us a reviving, to set up the house of our God, and to repair the desolations thereof, and to give us a wall in Judah and in Jerusalem.",
      "inline": false
    },

    {
      "name": "Isaiah 44:21",
      "value": "21 Remember these, O Jacob and Israel; for thou art my servant: I have formed thee; thou art my servant: O Israel, thou shalt not be forgotten of me.",
      "inline": false
    },

    {
      "name": "Isaiah 49:14-15",
      "value": "14 But Zion said, The Lord hath forsaken me, and my Lord hath forgotten me.\n\n15 Can a woman forget her sucking child, that she should not have compassion on the son of her womb? yea, they may forget, yet will I not forget thee.",
      "inline": false
    },

    {
      "name": "Psalms 138:8",
      "value": "8 The Lord will perfect that which concerneth me: thy mercy, O Lord, endureth for ever: forsake not the works of thine own hands.",
      "inline": false
    },

    {
      "name": "Psalms 139:17 (See Jeremiah 29:11 in the promise of Peace)",
      "value": "17 How precious also are thy thoughts unto me, O God! how great is the sum of them!",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "God promises to not leave nor forsake His children."
    }
  ]
}