{
  "author": "Daily Promise - Blessed is the man that keep His commandments.",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1379728610755084308/istockphoto-920732910-612x612.jpg?ex=68414be6&is=683ffa66&hm=3cf0225dc1275103d70034e7743221309a2fd1c5b59ffd91d52a03b5ac1eca96&",

  "fields": [

    {
      "name": "Exodus 20:5-6",
      "value": "5 Thou shalt not bow down thyself to them, nor serve them: for I the Lord thy God am a jealous God, visiting the iniquity of the fathers upon the children unto the third and fourth generation of them that hate me;\n\n6 And shewing mercy unto thousands of them that love me, and keep my commandments.",
      "inline": false
    },

    {
      "name": "Deuteronomy 11:22-25",
      "value": "22 For if ye shall diligently keep all these commandments which I command you, to do them, to love the Lord your God, to walk in all his ways, and to cleave unto him;\n\n23 Then will the Lord drive out all these nations from before you, and ye shall possess greater nations and mightier than yourselves.\n\n24 Every place whereon the soles of your feet shall tread shall be yours: from the wilderness and Lebanon, from the river, the river Euphrates, even unto the uttermost sea shall your coast be.\n\n25 There shall no man be able to stand before you: for the Lord your God shall lay the fear of you and the dread of you upon all the land that ye shall tread upon, as he hath said unto you.",
      "inline": false
    },

    {
      "name": "Psalm 112:1",
      "value": "1 Praise ye the LORD. Blessed is the man that feareth the LORD, that delighteth greatly in his commandments.",
      "inline": false
    },

    {
      "name": "Notes",
      "value": "This includes all that God has commanded us to keep.",
      "inline": false
    },

    {
      "name": "Malachi 3:6",
      "value": "6 For I am the LORD, I change not; therefore ye sons of Jacob are not consumed.",
      "inline": false
    },

    {
      "name": "End of Notes",
      "value": ".",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "God promises to bless and to have mercy on those that keep His Commandments, Statutes and Judgments."
    }
  ]
}