{
  "author": "Daily Promise - Blessed is the man who keeps God's commandments",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1379728610755084308/istockphoto-920732910-612x612.jpg?ex=68414be6&is=683ffa66&hm=3cf0225dc1275103d70034e7743221309a2fd1c5b59ffd91d52a03b5ac1eca96&",

  "fields": [

    {
      "name": "Exodus 20:5-6",
      "value": "5 Thou shalt not bow down thyself to them, nor serve them: for I the Lord thy God am a jealous God, visiting the iniquity of the fathers upon the children unto the third and fourth generation of them that hate me;\n\n6 And shewing mercy unto thousands of them that love me, and keep my commandments.",
      "inline": false
    },

    {
      "name": "Deuteronomy 11:22-25",
      "value": "22 For if ye shall diligently keep all these commandments which I command you, to do them, to love the Lord your God, to walk in all his ways, and to cleave unto him;\n\n23 Then will the Lord drive out all these nations from before you, and ye shall possess greater nations and mightier than yourselves.\n\n24 Every place whereon the soles of your feet shall tread shall be yours: from the wilderness and Lebanon, from the river, the river Euphrates, even unto the uttermost sea shall your coast be.\n\n25 There shall no man be able to stand before you: for the Lord your God shall lay the fear of you and the dread of you upon all the land that ye shall tread upon, as he hath said unto you.",
      "inline": false
    },

    {
      "name": "Deuteronomy 30:18-20",
      "value": "18 I denounce unto you this day, that ye shall surely perish, and that ye shall not prolong your days upon the land, whither thou passest over Jordan to go to possess it.\n\n19 I call heaven and earth to record this day against you, that I have set before you life and death, blessing and cursing: therefore choose life, that both thou and thy seed may live:\n\n20 That thou mayest love the Lord thy God, and that thou mayest obey his voice, and that thou mayest cleave unto him: for he is thy life, and the length of thy days: that thou mayest dwell in the land which the Lord sware unto thy fathers, to Abraham, to Isaac, and to Jacob, to give them.",
      "inline": false
    },

    {
      "name": "Notes: Deuteronomy 30:18-20",
      "value": "God records our actions and chooses. He promises to bless those who choose to obey His voice.",
      "inline": false
    },

    {
      "name": "End of Notes",
      "value": ".",
      "inline": false
    },

    {
      "name": "Psalm 112:1",
      "value": "1 Praise ye the LORD. Blessed is the man that feareth the LORD, that delighteth greatly in his commandments.",
      "inline": false
    },

    {
      "name": "Notes",
      "value": "These are the commandments which God has commanded us to keep, even after the death and resurrection of Christ. Please study them, so that you may have a better understanding of which is a commandment and which is a prophecy. God has given commandments, men have also given commandments, but we should follow the commandments of God. See the promise of guidance and Light.",
      "inline": false
    },

    {
      "name": "Exodus 20:1-17",
      "value": "1 And God spake all these words, saying,\n\n2 I am the Lord thy God, which have brought thee out of the land of Egypt, out of the house of bondage.\n\n3 Thou shalt have no other gods before me.\n\n4 Thou shalt not make unto thee any graven image, or any likeness of any thing that is in heaven above, or that is in the earth beneath, or that is in the water under the earth.\n\n5 Thou shalt not bow down thyself to them, nor serve them: for I the Lord thy God am a jealous God, visiting the iniquity of the fathers upon the children unto the third and fourth generation of them that hate me;\n\n6 And shewing mercy unto thousands of them that love me, and keep my commandments.\n\n7 Thou shalt not take the name of the Lord thy God in vain; for the Lord will not hold him guiltless that taketh his name in vain.\n\n8 Remember the sabbath day, to keep it holy.\n\n9 Six days shalt thou labour, and do all thy work:\n\n10 But the seventh day is the sabbath of the Lord thy God: in it thou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thy stranger that is within thy gates:\n\n11 For in six days the Lord made heaven and earth, the sea, and all that in them is, and rested the seventh day: wherefore the Lord blessed the sabbath day, and hallowed it.\n\n12 Honour thy father and thy mother: that thy days may be long upon the land which the Lord thy God giveth thee.\n\n13 Thou shalt not kill.\n\n14 Thou shalt not commit adultery.\n\n15 Thou shalt not steal.\n\n16 Thou shalt not bear false witness against thy neighbour.\n\n17 Thou shalt not covet thy neighbour's house, thou shalt not covet thy neighbour's wife, nor his manservant, nor his maidservant, nor his ox, nor his ass, nor any thing that is thy neighbour's.",
      "inline": false
    },

    {
      "name": "Joshua 1:8-9",
      "value": "8 This book of the law shall not depart out of thy mouth; but thou shalt meditate therein day and night, that thou mayest observe to do according to all that is written therein: for then thou shalt make thy way prosperous, and then thou shalt have good success.\n\n9 Have not I commanded thee? Be strong and of a good courage; be not afraid, neither be thou dismayed: for the Lord thy God is with thee whithersoever thou goest.",
      "inline": false
    },

    {
      "name": "Malachi 3:6",
      "value": "6 For I am the LORD, I change not; therefore ye sons of Jacob are not consumed.",
      "inline": false
    },

    {
      "name": "Matthew 5:18",
      "value": "18 For verily I say unto you, Till heaven and earth pass, one jot or one tittle shall in no wise pass from the law, till all be fulfilled.",
      "inline": false
    },

    {
      "name": "Matthew 22:37-40",
      "value": "37 Jesus said unto him, Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy mind.\n\n38 This is the first and great commandment.\n\n39 And the second is like unto it, Thou shalt love thy neighbour as thyself.\n\n40 On these two commandments hang all the law and the prophets.",
      "inline": false
    },

    {
      "name": "Matthew 24:35",
      "value": "35 Heaven and earth shall pass away, but my words shall not pass away.",
      "inline": false
    },

    {
      "name": "John 15:9-10,12",
      "value": "9 As the Father hath loved me, so have I loved you: continue ye in my love.\n\n10 If ye keep my commandments, ye shall abide in my love; even as I have kept my Father's commandments, and abide in his love.\n\n12 This is my commandment, That ye love one another, as I have loved you.",
      "inline": false
    },

    {
      "name": "Romans 12:1-2",
      "value": "1 I beseech you therefore, brethren, by the mercies of God, that ye present your bodies a living sacrifice, holy, acceptable unto God, which is your reasonable service.\n\n2 And be not conformed to this world: but be ye transformed by the renewing of your mind, that ye may prove what is that good, and acceptable, and perfect, will of God.",
      "inline": false
    },

    {
      "name": "Notes",
      "value": "The Bible can NOT contradict itself, neither is there anything false in it. When Jesus said, \"Ye are gods\", he meant that, since we are the children of God, we should do justice and righteousness like our God does. If you don't do justice and righteousness as our God does, then you need to come to God and become His child. Read Psalm 82.",
      "inline": false
    },

    {
      "name": "Psalm 82",
      "value": "1 God standeth in the congregation of the mighty; he judgeth among the gods.\n\n2 How long will ye judge unjustly, and accept the persons of the wicked? Selah.\n\n3 Defend the poor and fatherless: do justice to the afflicted and needy.\n\n4 Deliver the poor and needy: rid them out of the hand of the wicked.\n\n5 They know not, neither will they understand; they walk on in darkness: all the foundations of the earth are out of course.\n\n6 I have said, Ye are gods; and all of you are children of the most High.\n\n7 But ye shall die like men, and fall like one of the princes.\n\n8 Arise, O God, judge the earth: for thou shalt inherit all nations.",
      "inline": false
    },

    {
      "name": "John 10:34-35",
      "value": "34 Jesus answered them, Is it not written in your law, I said, Ye are gods?\n\n35 If he called them gods, unto whom the word of God came, and the scripture cannot be broken;",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "God promises to bless and to have mercy on those that keep His Commandments, Statutes and Judgments."
    }
  ]
}