{
  "author": "Daily Promise - Protection",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1377881232574120006/360_F_781481660_4lA82PjAxJpBgS8xTyhdVfBJ8ONHVeTw.png?ex=683a9365&is=683941e5&hm=ce1e0a87f76b95b9f27b211cc4fd43e24d292d38715461f7549aeb5d854e43dd&",

  "fields": [

    {
      "name": "Joshua 23:10",
      "value": "10 One man of you shall chase a thousand: for the LORD your God, he it is that fighteth for you, as he hath promised you.",
      "inline": false
    },

    {
      "name": "2 Samuel 22:37",
      "value": "37 Thou hast enlarged my steps under me; So that my feet did not slip.",
      "inline": false
    },

    {
      "name": "Isaiah 41:8-16",
      "value": "8 But thou, Israel, art my servant, Jacob whom I have chosen, the seed of Abraham my friend.\n\n9 Thou whom I have taken from the ends of the earth, and called thee from the chief men thereof, and said unto thee, Thou art my servant; I have chosen thee, and not cast thee away.\n\n10 Fear thou not; for I am with thee: be not dismayed; for I am thy God: I will strengthen thee; yea, I will help thee; yea, I will uphold thee with the right hand of my righteousness.\n\n11 Behold, all they that were incensed against thee shall be ashamed and confounded: they shall be as nothing; and they that strive with thee shall perish.\n\n12 Thou shalt seek them, and shalt not find them, even them that contended with thee: they that war against thee shall be as nothing, and as a thing of nought.\n\n13 For I the Lord thy God will hold thy right hand, saying unto thee, Fear not; I will help thee.\n\n14 Fear not, thou worm Jacob, and ye men of Israel; I will help thee, saith the Lord, and thy redeemer, the Holy One of Israel.\n\n15 Behold, I will make thee a new sharp threshing instrument having teeth: thou shalt thresh the mountains, and beat them small, and shalt make the hills as chaff.\n\n16 Thou shalt fan them, and the wind shall carry them away, and the whirlwind shall scatter them: and thou shalt rejoice in the Lord, and shalt glory in the Holy One of Israel.",
      "inline": false
    },

    {
      "name": "Isaiah 43:1-7",
      "value": "1 But now thus saith the Lord that created thee, O Jacob, and he that formed thee, O Israel, Fear not: for I have redeemed thee, I have called thee by thy name; thou art mine.\n\n2 When thou passest through the waters, I will be with thee; and through the rivers, they shall not overflow thee: when thou walkest through the fire, thou shalt not be burned; neither shall the flame kindle upon thee.\n\n3 For I am the Lord thy God, the Holy One of Israel, thy Saviour: I gave Egypt for thy ransom, Ethiopia and Seba for thee.\n\n4 Since thou wast precious in my sight, thou hast been honourable, and I have loved thee: therefore will I give men for thee, and people for thy life.\n\n5 Fear not: for I am with thee: I will bring thy seed from the east, and gather thee from the west;\n\n6 I will say to the north, Give up; and to the south, Keep not back: bring my sons from far, and my daughters from the ends of the earth;\n\n7 Even every one that is called by my name: for I have created him for my glory, I have formed him; yea, I have made him.",
      "inline": false
    },

    {
      "name": "Isaiah 54:17",
      "value": "17 No weapon that is formed against thee shall prosper; and every tongue that shall rise against thee in judgment thou shalt condemn. This is the heritage of the servants of the Lord, and their righteousness is of me, saith the Lord.",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "God promises to protect His people."
    }
  ]
}