{
    "author": "Daily Promise - Providing",
    "footer": "King James Version (KJV)",
    "color": "green",
    "url": "",
    "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1377667742559113336/360_F_294213591_Kohh5RAIgSzAha2bGPj13pGFCVbNtnf3.png?ex=6839cc91&is=68387b11&hm=ac1c7c39d1b04a36ea984be0002139fa79eb56e7739b541e1236d83ee6129063&",
  
    "fields": [

      {
        "name": "Genesis 12:1-5",
        "value": "1 Now the Lord had said unto Abram, Get thee out of thy country, and from thy kindred, and from thy father's house, unto a land that I will shew thee:\n\n2 And I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing:\n\n3 And I will bless them that bless thee, and curse him that curseth thee: and in thee shall all families of the earth be blessed.\n\n4 So Abram departed, as the Lord had spoken unto him; and Lot went with him: and Abram was seventy and five years old when he departed out of Haran.\n\n5 And Abram took Sarai his wife, and Lot his brother's son, and all their substance that they had gathered, and the souls that they had gotten in Haran; and they went forth to go into the land of Canaan; and into the land of Canaan they came.",
        "inline": false
      },

      {
        "name": "Genesis 22:8",
        "value": "8 And Abraham said, My son, God will provide himself a lamb for a burnt offering: so they went both of them together.",
        "inline": false
      },

      {
        "name": "Deuteronomy 2:7",
        "value": "7 For the Lord thy God hath blessed thee in all the works of thy hand: he knoweth thy walking through this great wilderness: these forty years the Lord thy God hath been with thee; thou hast lacked nothing.",
        "inline": false
      },

      {
        "name": "Deuteronomy 15:6",
        "value": "6 For the LORD thy God blesseth thee, as he promised thee: and thou shalt lend unto many nations, but thou shalt not borrow; and thou shalt reign over many nations, but they shall not reign over thee.",
        "inline": false
      },

      {
        "name": "1 Kings 17:2-24",
        "value": "2 And the word of the Lord came unto him, saying,\n\n3 Get thee hence, and turn thee eastward, and hide thyself by the brook Cherith, that is before Jordan.\n\n4 And it shall be, that thou shalt drink of the brook; and I have commanded the ravens to feed thee there.\n\n5 So he went and did according unto the word of the Lord: for he went and dwelt by the brook Cherith, that is before Jordan.\n\n6 And the ravens brought him bread and flesh in the morning, and bread and flesh in the evening; and he drank of the brook.\n\n7 And it came to pass after a while, that the brook dried up, because there had been no rain in the land.\n\n8 And the word of the Lord came unto him, saying,\n\n9 Arise, get thee to Zarephath, which belongeth to Zidon, and dwell there: behold, I have commanded a widow woman there to sustain thee.\n\n10 So he arose and went to Zarephath. And when he came to the gate of the city, behold, the widow woman was there gathering of sticks: and he called to her, and said, Fetch me, I pray thee, a little water in a vessel, that I may drink.\n\n11 And as she was going to fetch it, he called to her, and said, Bring me, I pray thee, a morsel of bread in thine hand.\n\n12 And she said, As the Lord thy God liveth, I have not a cake, but an handful of meal in a barrel, and a little oil in a cruse: and, behold, I am gathering two sticks, that I may go in and dress it for me and my son, that we may eat it, and die.\n\n13 And Elijah said unto her, Fear not; go and do as thou hast said: but make me thereof a little cake first, and bring it unto me, and after make for thee and for thy son.\n\n14 For thus saith the Lord God of Israel, The barrel of meal shall not waste, neither shall the cruse of oil fail, until the day that the Lord sendeth rain upon the earth.\n\n15 And she went and did according to the saying of Elijah: and she, and he, and her house, did eat many days.\n\n16 And the barrel of meal wasted not, neither did the cruse of oil fail, according to the word of the Lord, which he spake by Elijah.\n\n17 And it came to pass after these things, that the son of the woman, the mistress of the house, fell sick; and his sickness was so sore, that there was no breath left in him.\n\n18 And she said unto Elijah, What have I to do with thee, O thou man of God? art thou come unto me to call my sin to remembrance, and to slay my son?\n\n19 And he said unto her, Give me thy son. And he took him out of her bosom, and carried him up into a loft, where he abode, and laid him upon his own bed.\n\n20 And he cried unto the Lord, and said, O Lord my God, hast thou also brought evil upon the widow with whom I sojourn, by slaying her son?\n\n21 And he stretched himself upon the child three times, and cried unto the Lord, and said, O Lord my God, I pray thee, let this child's soul come into him again.\n\n22 And the Lord heard the voice of Elijah; and the soul of the child came into him again, and he revived.\n\n23 And Elijah took the child, and brought him down out of the chamber into the house, and delivered him unto his mother: and Elijah said, See, thy son liveth.\n\n24 And the woman said to Elijah, Now by this I know that thou art a man of God, and that the word of the Lord in thy mouth is truth.",
        "inline": false
      },

      {
        "name": "Psalm 23",
        "value": "1 The Lord is my shepherd; I shall not want.\n\n2 He maketh me to lie down in green pastures: he leadeth me beside the still waters.\n\n3 He restoreth my soul: he leadeth me in the paths of righteousness for his name's sake.\n\n4 Yea, though I walk through the valley of the shadow of death, I will fear no evil: for thou art with me; thy rod and thy staff they comfort me.\n\n5 Thou preparest a table before me in the presence of mine enemies: thou anointest my head with oil; my cup runneth over.\n\n6 Surely goodness and mercy shall follow me all the days of my life: and I will dwell in the house of the Lord for ever.",
        "inline": false
      },

      {
        "name": "Psalm 37:1-7",
        "value": "1 Fret not thyself because of evildoers, neither be thou envious against the workers of iniquity.\n\n2 For they shall soon be cut down like the grass, and wither as the green herb.\n\n3 Trust in the Lord, and do good; so shalt thou dwell in the land, and verily thou shalt be fed.\n\n4 Delight thyself also in the Lord: and he shall give thee the desires of thine heart.\n\n5 Commit thy way unto the Lord; trust also in him; and he shall bring it to pass.\n\n6 And he shall bring forth thy righteousness as the light, and thy judgment as the noonday.\n\n7 Rest in the Lord, and wait patiently for him: fret not thyself because of him who prospereth in his way, because of the man who bringeth wicked devices to pass.",
        "inline": false
      },

      {
        "name": "Psalm 37:9",
        "value": "9 For evildoers shall be cut off: but those that wait upon the Lord, they shall inherit the earth.",
        "inline": false
      },

      {
        "name": "Matthew 6:8",
        "value": "8 Be not ye therefore like unto them: for your Father knoweth what things ye have need of, before ye ask him.",
        "inline": false
      },

      {
        "name": "Matthew 6:25-34",
        "value": "25 Therefore I say unto you, Take no thought for your life, what ye shall eat, or what ye shall drink; nor yet for your body, what ye shall put on. Is not the life more than meat, and the body than raiment?\n\n26 Behold the fowls of the air: for they sow not, neither do they reap, nor gather into barns; yet your heavenly Father feedeth them. Are ye not much better than they?\n\n27 Which of you by taking thought can add one cubit unto his stature?\n\n28 And why take ye thought for raiment? Consider the lilies of the field, how they grow; they toil not, neither do they spin:\n\n29 And yet I say unto you, That even Solomon in all his glory was not arrayed like one of these.\n\n30 Wherefore, if God so clothe the grass of the field, which to day is, and to morrow is cast into the oven, shall he not much more clothe you, O ye of little faith?\n\n31 Therefore take no thought, saying, What shall we eat? or, What shall we drink? or, Wherewithal shall we be clothed?\n\n32 (For after all these things do the Gentiles seek:) for your heavenly Father knoweth that ye have need of all these things.\n\n33 But seek ye first the kingdom of God, and his righteousness; and all these things shall be added unto you.\n\n34 Take therefore no thought for the morrow: for the morrow shall take thought for the things of itself. Sufficient unto the day is the evil thereof.",
        "inline": false
      },

      {
        "name": "Mark 10:28-30",
        "value": "28 Then Peter began to say unto him, Lo, we have left all, and have followed thee.\n\n29 And Jesus answered and said, Verily I say unto you, There is no man that hath left house, or brethren, or sisters, or father, or mother, or wife, or children, or lands, for my sake, and the gospel's,\n\n30 But he shall receive an hundredfold now in this time, houses, and brethren, and sisters, and mothers, and children, and lands, with persecutions; and in the world to come eternal life.",
        "inline": false
      },

      {
        "name": "Philippians 4:18-20",
        "value": "18 But I have all, and abound: I am full, having received of Epaphroditus the things which were sent from you, an odour of a sweet smell, a sacrifice acceptable, wellpleasing to God.\n\n19 But my God shall supply all your need according to his riches in glory by Christ Jesus.\n\n20 Now unto God and our Father be glory for ever and ever. Amen.",
        "inline": false
      },

      {
        "name": "Philippians 4:6",
        "value": "6 Be careful for nothing; but in every thing by prayer and supplication with thanksgiving let your requests be made known unto God.",
        "inline": false
      },
  
      {
        "name": "Hebrews 11:8-10",
        "value": "8 By faith Abraham, when he was called to go out into a place which he should after receive for an inheritance, obeyed; and he went out, not knowing whither he went.\n\n9 By faith he sojourned in the land of promise, as in a strange country, dwelling in tabernacles with Isaac and Jacob, the heirs with him of the same promise:\n\n10 For he looked for a city which hath foundations, whose builder and maker is God.",
        "inline": false
      },
  
      {
        "name": "Summary",
        "value": "God promises us to provide for His children. He is our Heavenly Father, and He always provides whatever we need for His own children."
      }
    ]
  }