{
  "author": "Daily Promise - Rest on the Sabbath",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1379712728431726672/paul-preaching.jpg?ex=68413d1c&is=683feb9c&hm=3bbee3d59f1458e9e409a3578ddc74c9098c76d66aa94bb9db977700b3cc6c99&",

  "fields": [

    {
      "name": "Exodus 20:8-11",
      "value": "8 Remember the sabbath day, to keep it holy.\n\n9 Six days shalt thou labour, and do all thy work:\n\n10 But the seventh day is the sabbath of the Lord thy God: in it thou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thy stranger that is within thy gates:\n\n11 For in six days the Lord made heaven and earth, the sea, and all that in them is, and rested the seventh day: wherefore the Lord blessed the sabbath day, and hallowed it.",
      "inline": false
    },

    {
      "name": "Exodus 31:12-14",
      "value": "12 And the Lord spake unto Moses, saying,\n\n13 Speak thou also unto the children of Israel, saying, Verily my sabbaths ye shall keep: for it is a sign between me and you throughout your generations; that ye may know that I am the Lord that doth sanctify you.\n\n14 Ye shall keep the sabbath therefore; for it is holy unto you: every one that defileth it shall surely be put to death: for whosoever doeth any work therein, that soul shall be cut off from among his people.",
      "inline": false
    },

    {
      "name": "Isaiah 56:2",
      "value": "2 Blessed is the man that doeth this, and the son of man that layeth hold on it; that keepeth the sabbath from polluting it, and keepeth his hand from doing any evil.",
      "inline": false
    },

    {
      "name": "Isaiah 58:13-14",
      "value": "13 If thou turn away thy foot from the sabbath, from doing thy pleasure on my holy day; and call the sabbath a delight, the holy of the Lord, honourable; and shalt honour him, not doing thine own ways, nor finding thine own pleasure, nor speaking thine own words:\n\n14 Then shalt thou delight thyself in the Lord; and I will cause thee to ride upon the high places of the earth, and feed thee with the heritage of Jacob thy father: for the mouth of the Lord hath spoken it.",
      "inline": false
    },

    {
      "name": "Matthew 12:8",
      "value": "8 For the Son of man is Lord even of the sabbath day.",
      "inline": false
    },

    {
      "name": "Mark 1:21-22",
      "value": "21 And they went into Capernaum; and straightway on the sabbath day he entered into the synagogue, and taught.\n\n22 And they were astonished at his doctrine: for he taught them as one that had authority, and not as the scribes.",
      "inline": false
    },

    {
      "name": "Mark 2:27",
      "value": "27 And he said unto them, The sabbath was made for man, and not man for the sabbath:",
      "inline": false
    },

    {
      "name": "Mark 6:1-2",
      "value": "1 And he went out from thence, and came into his own country; and his disciples follow him.\n\n2 And when the sabbath day was come, he began to teach in the synagogue: and many hearing him were astonished, saying, From whence hath this man these things? and what wisdom is this which is given unto him, that even such mighty works are wrought by his hands?",
      "inline": false
    },

    {
      "name": "Luke 6:9-10",
      "value": "9 Then said Jesus unto them, I will ask you one thing; Is it lawful on the sabbath days to do good, or to do evil? to save life, or to destroy it?\n\nAnd looking round about upon them all, he said unto the man, Stretch forth thy hand. And he did so: and his hand was restored whole as the other.",
      "inline": false
    },

    {
      "name": "Luke 13:10-13",
      "value": "10 And he was teaching in one of the synagogues on the sabbath.\n\n11 And, behold, there was a woman which had a spirit of infirmity eighteen years, and was bowed together, and could in no wise lift up herself.\n\n12 And when Jesus saw her, he called her to him, and said unto her, Woman, thou art loosed from thine infirmity.\n\n13 And he laid his hands on her: and immediately she was made straight, and glorified God.",
      "inline": false
    },

    {
      "name": "Acts 13:14,42",
      "value": "14 But when they departed from Perga, they came to Antioch in Pisidia, and went into the synagogue on the sabbath day, and sat down.\n\n42 And when the Jews were gone out of the synagogue, the Gentiles besought that these words might be preached to them the next sabbath.",
      "inline": false
    },

    {
      "name": "Acts 18:1-4",
      "value": "1 After these things Paul departed from Athens, and came to Corinth;\n\n2 And found a certain Jew named Aquila, born in Pontus, lately come from Italy, with his wife Priscilla; (because that Claudius had commanded all Jews to depart from Rome:) and came unto them.\n\n3 And because he was of the same craft, he abode with them, and wrought: for by their occupation they were tentmakers.\n\n4 And he reasoned in the synagogue every sabbath, and persuaded the Jews and the Greeks.",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "Keeping the Sabbath is good for us and others. It is the day when we do what pleases God, rather than our own work. Look at the apostles and how they rested on the Sabbath. Teaching people how to observe and do the commandments of God, sharing the gospel, studying the Bible, fellowship with the saints, etc."
    }
  ]
}