{
  "author": "Daily Promise - Rest on the Sabbath",
  "footer": "King James Version (KJV)",
  "color": "green",
  "url": "",
  "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1379712728431726672/paul-preaching.jpg?ex=68413d1c&is=683feb9c&hm=3bbee3d59f1458e9e409a3578ddc74c9098c76d66aa94bb9db977700b3cc6c99&",

  "fields": [

    {
      "name": "Notes",
      "value": "The scriptures tell us that there is a day which is called the Sabbath day and God wants us to keep it holy, as a sign between God and His people.",
      "inline": false
    },

    {
      "name": "Exodus 16:22",
      "value": "22 And it came to pass, that on the sixth day they gathered twice as much bread, two omers for one man: and all the rulers of the congregation came and told Moses.",
      "inline": false
    },

    {
      "name": "Matthew 28:1",
      "value": "1 In the end of the sabbath, as it began to dawn toward the first day of the week, came Mary Magdalene and the other Mary to see the sepulchre.",
      "inline": false
    },

    {
      "name": "Mark 15:42",
      "value": "42 And now when the even was come, because it was the preparation, that is, the day before the sabbath,",
      "inline": false
    },

    {
      "name": "Mark 16:1-2,9",
      "value": "1 And when the sabbath was past, Mary Magdalene, and Mary the mother of James, and Salome, had bought sweet spices, that they might come and anoint him.\n\n2 And very early in the morning the first day of the week, they came unto the sepulchre at the rising of the sun.\n\n9 Now when Jesus was risen early the first day of the week, he appeared first to Mary Magdalene, out of whom he had cast seven devils.",
      "inline": false
    },

    {
      "name": "Luke 23:52-56",
      "value": "52 This man went unto Pilate, and begged the body of Jesus.\n\n53 And he took it down, and wrapped it in linen, and laid it in a sepulchre that was hewn in stone, wherein never man before was laid.\n\n54 And that day was the preparation, and the sabbath drew on.\n\n55 And the women also, which came with him from Galilee, followed after, and beheld the sepulchre, and how his body was laid.\n\n56 And they returned, and prepared spices and ointments; and rested the sabbath day according to the commandment.",
      "inline": false
    },

    {
      "name": "John 19:31-37,41-42",
      "value": "31 The Jews therefore, because it was the preparation, that the bodies should not remain upon the cross on the sabbath day, (for that sabbath day was an high day,) besought Pilate that their legs might be broken, and that they might be taken away.\n\n32 Then came the soldiers, and brake the legs of the first, and of the other which was crucified with him.\n\n33 But when they came to Jesus, and saw that he was dead already, they brake not his legs:\n\n34 But one of the soldiers with a spear pierced his side, and forthwith came there out blood and water.\n\n35 And he that saw it bare record, and his record is true: and he knoweth that he saith true, that ye might believe.\n\n36 For these things were done, that the scripture should be fulfilled, A bone of him shall not be broken.\n\n37 And again another scripture saith, They shall look on him whom they pierced.\n\n41 Now in the place where he was crucified there was a garden; and in the garden a new sepulchre, wherein was never man yet laid.\n\n42 There laid they Jesus therefore because of the Jews' preparation day; for the sepulchre was nigh at hand.",
      "inline": false
    },

    {
      "name": "Notes",
      "value": "You will see that this is a Jewish tradition. To keep the Sabbath day and the preparation day, but when Jesus came and died, and resurrected from death and paid the price (of death/the wages of sin is death) for our sins, that we might be again with God. For, behold, sin separates you from God. Then God would require us to keep His commandments, but is there an agreement? Yes. The covenant of God with men. Now, if you don't want to be with God, then you can do whatever you want and die, but if you want to be with God, then you have to fulfill your duties that come from being a true Christian. This is a two-way relationship. On one side, you obey God, and on the other side, God helps you (you may want to look at His promises) and gives you eternal life (at the end of your journey, if you have kept the faith).",
      "inline": false
    },

    {
      "name": "End of Notes",
      "value": ".",
      "inline": false
    },

    {
      "name": "Exodus 20:8-11",
      "value": "8 Remember the sabbath day, to keep it holy.\n\n9 Six days shalt thou labour, and do all thy work:\n\n10 But the seventh day is the sabbath of the Lord thy God: in it thou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thy stranger that is within thy gates:\n\n11 For in six days the Lord made heaven and earth, the sea, and all that in them is, and rested the seventh day: wherefore the Lord blessed the sabbath day, and hallowed it.",
      "inline": false
    },

    {
      "name": "Exodus 31:12-14",
      "value": "12 And the Lord spake unto Moses, saying,\n\n13 Speak thou also unto the children of Israel, saying, Verily my sabbaths ye shall keep: for it is a sign between me and you throughout your generations; that ye may know that I am the Lord that doth sanctify you.\n\n14 Ye shall keep the sabbath therefore; for it is holy unto you: every one that defileth it shall surely be put to death: for whosoever doeth any work therein, that soul shall be cut off from among his people.",
      "inline": false
    },

    {
      "name": "Isaiah 56:2",
      "value": "2 Blessed is the man that doeth this, and the son of man that layeth hold on it; that keepeth the sabbath from polluting it, and keepeth his hand from doing any evil.",
      "inline": false
    },

    {
      "name": "Isaiah 58:13-14",
      "value": "13 If thou turn away thy foot from the sabbath, from doing thy pleasure on my holy day; and call the sabbath a delight, the holy of the Lord, honourable; and shalt honour him, not doing thine own ways, nor finding thine own pleasure, nor speaking thine own words:\n\n14 Then shalt thou delight thyself in the Lord; and I will cause thee to ride upon the high places of the earth, and feed thee with the heritage of Jacob thy father: for the mouth of the Lord hath spoken it.",
      "inline": false
    },

    {
      "name": "Matthew 12:8",
      "value": "8 For the Son of man is Lord even of the sabbath day.",
      "inline": false
    },

    {
      "name": "Mark 1:21-22",
      "value": "21 And they went into Capernaum; and straightway on the sabbath day he entered into the synagogue, and taught.\n\n22 And they were astonished at his doctrine: for he taught them as one that had authority, and not as the scribes.",
      "inline": false
    },

    {
      "name": "Mark 2:27",
      "value": "27 And he said unto them, The sabbath was made for man, and not man for the sabbath:",
      "inline": false
    },

    {
      "name": "Mark 6:1-2",
      "value": "1 And he went out from thence, and came into his own country; and his disciples follow him.\n\n2 And when the sabbath day was come, he began to teach in the synagogue: and many hearing him were astonished, saying, From whence hath this man these things? and what wisdom is this which is given unto him, that even such mighty works are wrought by his hands?",
      "inline": false
    },

    {
      "name": "Luke 6:9-10",
      "value": "9 Then said Jesus unto them, I will ask you one thing; Is it lawful on the sabbath days to do good, or to do evil? to save life, or to destroy it?\n\nAnd looking round about upon them all, he said unto the man, Stretch forth thy hand. And he did so: and his hand was restored whole as the other.",
      "inline": false
    },

    {
      "name": "Luke 13:10-13",
      "value": "10 And he was teaching in one of the synagogues on the sabbath.\n\n11 And, behold, there was a woman which had a spirit of infirmity eighteen years, and was bowed together, and could in no wise lift up herself.\n\n12 And when Jesus saw her, he called her to him, and said unto her, Woman, thou art loosed from thine infirmity.\n\n13 And he laid his hands on her: and immediately she was made straight, and glorified God.",
      "inline": false
    },

    {
      "name": "Acts 13:14,42",
      "value": "14 But when they departed from Perga, they came to Antioch in Pisidia, and went into the synagogue on the sabbath day, and sat down.\n\n42 And when the Jews were gone out of the synagogue, the Gentiles besought that these words might be preached to them the next sabbath.",
      "inline": false
    },

    {
      "name": "Acts 18:1-4",
      "value": "1 After these things Paul departed from Athens, and came to Corinth;\n\n2 And found a certain Jew named Aquila, born in Pontus, lately come from Italy, with his wife Priscilla; (because that Claudius had commanded all Jews to depart from Rome:) and came unto them.\n\n3 And because he was of the same craft, he abode with them, and wrought: for by their occupation they were tentmakers.\n\n4 And he reasoned in the synagogue every sabbath, and persuaded the Jews and the Greeks.",
      "inline": false
    },

    {
      "name": "Summary",
      "value": "Keeping the Sabbath is good for us and others. It is the day when we do what pleases God, rather than our own work. Look at the apostles and how they rested on the Sabbath. Teaching people how to observe and do the commandments of God, sharing the gospel, studying the Bible, fellowship with the saints, etc."
    }
  ]
}