{
    "author": "Daily Promise - Strength",
    "footer": "King James Version (KJV)",
    "color": "green",
    "url": "",
    "image": "https://cdn.discordapp.com/attachments/1373997423160197130/1377668234941173790/male-lifting-weight-1296x728-header.png?ex=6839cd07&is=68387b87&hm=4f074a26ea419a129ab8188f38995c4d2971b4e22b728eed33478bd01fbedc5c&",
  
    "fields": [

      {
        "name": "Genesis 49:24",
        "value": "24 But his bow abode in strength, and the arms of his hands were made strong by the hands of the mighty God of Jacob; (from thence is the shepherd, the stone of Israel:)",
        "inline": false
      },

      {
        "name": "Exodus 13:14",
        "value": "14 And it shall be when thy son asketh thee in time to come, saying, What is this? that thou shalt say unto him, By strength of hand the Lord brought us out from Egypt, from the house of bondage:",
        "inline": false
      },

      {
        "name": "Exodus 15:2",
        "value": "2 The Lord is my strength and song, and he is become my salvation: he is my God, and I will prepare him an habitation; my father's God, and I will exalt him.",
        "inline": false
      },

      {
        "name": "Exodus 15:13",
        "value": "13 Thou in thy mercy hast led forth the people which thou hast redeemed: thou hast guided them in thy strength unto thy holy habitation.",
        "inline": false
      },

      {
        "name": "Joshua 14:11",
        "value": "11 As yet I am as strong this day as I was in the day that Moses sent me: as my strength was then, even so is my strength now, for war, both to go out, and to come in.",
        "inline": false
      },

      {
        "name": "2 Samuel 22:33",
        "value": "33 God is my strength and power: and he maketh my way perfect.",
        "inline": false
      },

      {
        "name": "2 Samuel 22:40",
        "value": "40 For thou hast girded me with strength to battle: them that rose up against me hast thou subdued under me.",
        "inline": false
      },

      {
        "name": "1 Chronicles 16:11",
        "value": "11 Seek the LORD and his strength, Seek his face continually.",
        "inline": false
      },
  
      {
        "name": "1 Chronicles 29:11-13",
        "value": "11 Thine, O Lord is the greatness, and the power, and the glory, and the victory, and the majesty: for all that is in the heaven and in the earth is thine; thine is the kingdom, O Lord, and thou art exalted as head above all.\n\n12 Both riches and honour come of thee, and thou reignest over all; and in thine hand is power and might; and in thine hand it is to make great, and to give strength unto all.\n\n13 Now therefore, our God, we thank thee, and praise thy glorious name.",
        "inline": false
      },

      {
        "name": "2 Chronicles 1:1",
        "value": "1 And Solomon the son of David was strengthened in his kingdom, and the Lord his God was with him, and magnified him exceedingly.",
        "inline": false
      },

      {
        "name": "Ezra 6:22",
        "value": "22 And kept the feast of unleavened bread seven days with joy: for the Lord had made them joyful, and turned the heart of the king of Assyria unto them, to strengthen their hands in the work of the house of God, the God of Israel.",
        "inline": false
      },

      {
        "name": "Ezra 7:28",
        "value": "28 And hath extended mercy unto me before the king, and his counsellors, and before all the king's mighty princes. And I was strengthened as the hand of the Lord my God was upon me, and I gathered together out of Israel chief men to go up with me.",
        "inline": false
      },

      {
        "name": "Nehemiah 6:9",
        "value": "9 For they all made us afraid, saying, Their hands shall be weakened from the work, that it be not done. Now therefore, O God, strengthen my hands.",
        "inline": false
      },

      {
        "name": "Nehemiah 8:10",
        "value": "10 Then he said unto them, Go your way, eat the fat, and drink the sweet, and send portions unto them for whom nothing is prepared: for this day is holy unto our Lord: neither be ye sorry; for the joy of the Lord is your strength.",
        "inline": false
      },

      {
        "name": "Job 4:3-4",
        "value": "3 Behold, thou hast instructed many, and thou hast strengthened the weak hands.\n\n4 Thy words have upholden him that was falling, and thou hast strengthened the feeble knees.",
        "inline": false
      },

      {
        "name": "Psalm 18:1-2",
        "value": "1 I will love thee, O Lord, my strength.\n\n2 The Lord is my rock, and my fortress, and my deliverer; my God, my strength, in whom I will trust; my buckler, and the horn of my salvation, and my high tower.",
        "inline": false
      },

      {
        "name": "Psalm 18:32",
        "value": "32 It is God that girdeth me with strength, and maketh my way perfect.",
        "inline": false
      },

      {
        "name": "Psalm 19:14",
        "value": "14 Let the words of my mouth, and the meditation of my heart, be acceptable in thy sight, O Lord, my strength, and my redeemer.",
        "inline": false
      },

      {
        "name": "Psalm 21:1",
        "value": "1 The king shall joy in thy strength, O Lord; and in thy salvation how greatly shall he rejoice!",
        "inline": false
      },

      {
        "name": "Psalm 22:19",
        "value": "19 But be not thou far from me, O Lord: O my strength, haste thee to help me.",
        "inline": false
      },

      {
        "name": "Isaiah 26:4",
        "value": "4 Trust ye in the LORD for ever: for in the LORD JEHOVAH is everlasting strength:",
        "inline": false
      },

      {
        "name": "2 Corinthians 12:9",
        "value": "9 And he said unto me, My grace is sufficient for thee: for my strength is made perfect in weakness. Most gladly therefore will I rather glory in my infirmities, that the power of Christ may rest upon me.",
        "inline": false
      },

      {
        "name": "Ephesians 3:15-17",
        "value": "15 Of whom the whole family in heaven and earth is named,\n\n16 That he would grant you, according to the riches of his glory, to be strengthened with might by his Spirit in the inner man;\n\n17 That Christ may dwell in your hearts by faith; that ye, being rooted and grounded in love,",
        "inline": false
      },

      {
        "name": "Philippians 4:13",
        "value": "13 I can do all things through Christ which strengtheneth me. ",
        "inline": false
      },

      {
        "name": "Colossians 1:10-12",
        "value": "10 That ye might walk worthy of the Lord unto all pleasing, being fruitful in every good work, and increasing in the knowledge of God;\n\n11 Strengthened with all might, according to his glorious power, unto all patience and longsuffering with joyfulness;\n\n12 Giving thanks unto the Father, which hath made us meet to be partakers of the inheritance of the saints in light:",
        "inline": false
      },

      {
        "name": "Hebrews 11:11",
        "value": "11 Through faith also Sara herself received strength to conceive seed, and was delivered of a child when she was past age, because she judged him faithful who had promised.",
        "inline": false
      },

      {
        "name": "1 Peter 5:10",
        "value": "10 But the God of all grace, who hath called us unto his eternal glory by Christ Jesus, after that ye have suffered a while, make you perfect, stablish, strengthen, settle you.",
        "inline": false
      },

      {
        "name": "Summary",
        "value": "God promises to provide us with strength when we surrender and trust Him. God can give us strength to battle temptation and to defeat our enemies."
      }
    ]
  }